Public Attributes | List of all members
API_ElemPartQuantity Struct Reference
Element Manager API
Describes the different calculated values for parts of an element. More...
#include <APIdefs_Elements.h>
 Public Attributes
API_ElemPartId  | partId
Identifier of the part of the elem.
API_ElementQuantity  | quantity
Quantity values for the specified part of the elem.
Detailed Description
Describes the different calculated values for parts of an element.
Member Data Documentation
◆ partId
 API_ElemPartQuantity::partId
Identifier of the part of the elem.
◆ quantity
 API_ElemPartQuantity::quantity
Quantity values for the specified part of the elem.